Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: Reply with a static file using L<Mojolicious/"static">, usually from the C<public> directories or C<DATA> sections of your application.
ja: Reply with a static file using [[Mojolicious/"static"]], usually from the C<public> directories or C<DATA> sections of your application.

source: Requests can be performed very comfortably with methods like L<Mojo::UserAgent/"get">, and always result in a L<Mojo::Transaction::HTTP> object, which has many useful attributes and methods.
ja: Requests can be performed very comfortably with methods like [[Mojo::UserAgent/"get"]], and always result in a [[Mojo::Transaction::HTTP]] object, which has many useful attributes and methods.

source: Resolve or reject L<Mojo::Promise> object with L<Mojo::Transaction::HTTP> object.
ja: Resolve or reject [[Mojo::Promise]] object with [[Mojo::Transaction::HTTP]] object.

source: Resolve the path with L<Cwd> and return the result as a L<Mojo::File> object.
ja: Resolve the path with [[Cwd]] and return the result as a [[Mojo::File]] object.

source: Response content is often generated by actions with L<Mojolicious::Controller/"render">, but more about that later.
ja: レスポンスコンテントの多くは [[Mojolicious::Controller]]のC<render>を使ったアクションによって生成されます。詳しくは後ほど。

source: Responsible for connecting file extensions with MIME types, defaults to a L<Mojolicious::Types> object.
ja: Responsible for connecting file extensions with MIME types, defaults to a [[Mojolicious::Types]] object.

source: Results are accessible via L<Mojolicious::Controller/"stash"> and L<Mojolicious::Controller/"param">.
ja: 結果は[[Mojolicious::Controller]]のC<stash>とC<param>を通じて利用できます。

source: Results are automatically wrapped in L<Mojo::ByteStream> objects to prevent accidental double escaping in C<ep> templates.
ja: Results are automatically wrapped in [[Mojo::ByteStream]] objects to prevent accidental double escaping in C<ep> templates.

source: Resume L</"handshake"> transaction.
ja: Resume [[/"handshake"]] transaction.

source: Retrieve L</"body"> and try to decode it with L<Mojo::Content/"charset"> or L</"default_charset">.
ja: Retrieve [[/"body"]] and try to decode it with [[Mojo::Content/"charset"]] or [[/"default_charset"]].

source: Retrieve message body from L</"text"> and turn it into a L<Mojo::DOM> object, an optional selector can be used to call the method L<Mojo::DOM/"find"> on it right away, which then returns a L<Mojo::Collection> object.
ja: Retrieve message body from [[/"text"]] and turn it into a [[Mojo::DOM]] object, an optional selector can be used to call the method [[Mojo::DOM/"find"]] on it right away, which then returns a [[Mojo::Collection]] object.

source: Return L<Mojo::DOM> object for C<root> node.
ja: Return [[Mojo::DOM]] object for C<root> node.

source: Return L<Mojo::DOM> object for next sibling element, or C<undef> if there are no more siblings.
ja: Return [[Mojo::DOM]] object for next sibling element, or C<undef> if there are no more siblings.

source: Return L<Mojo::DOM> object for next sibling node, or C<undef> if there are no more siblings.
ja: Return [[Mojo::DOM]] object for next sibling node, or C<undef> if there are no more siblings.

source: Return L<Mojo::DOM> object for parent of this node, or C<undef> if this node has no parent.
ja: Return [[Mojo::DOM]] object for parent of this node, or C<undef> if this node has no parent.

source: Return L<Mojo::DOM> object for previous sibling element, or C<undef> if there are no more siblings.
ja: Return [[Mojo::DOM]] object for previous sibling element, or C<undef> if there are no more siblings.

source: Return L<Mojo::DOM> object for previous sibling node, or C<undef> if there are no more siblings.
ja: Return [[Mojo::DOM]] object for previous sibling node, or C<undef> if there are no more siblings.

source: Return a C<DATA> section template from L</"classes"> for an options hash reference with C<template>, C<format>, C<variant> and C<handler> values, or C<undef> if no template could be found, usually used by handlers.
ja: Return a C<DATA> section template from [[/"classes"> for an options hash reference with C<template>, C<format>, C<variant> and C<handler> values, or C<undef> if no template could be found, usually used by handlers.

source: Return a L<File::stat> object for the path.
ja: Return a [[File::stat]] object for the path.

source: Return a L<File::stat> object for the symlink.
ja: Return a [[File::stat]] object for the symlink.

source: Return a L<Mojo::Collection> object containing all child nodes of this element as L<Mojo::DOM> objects.
ja: Return a [[Mojo::Collection]] object containing all child nodes of this element as [[Mojo::DOM]] objects.

source: Return a L<Mojo::Collection> object containing all descendant nodes of this element as L<Mojo::DOM> objects.
ja: Return a [[Mojo::Collection]] object containing all descendant nodes of this element as [[Mojo::DOM]] objects.

source: Return a L<Mojo::Collection> object containing all sibling nodes after this node as L<Mojo::DOM> objects.
ja: Return a [[Mojo::Collection]] object containing all sibling nodes after this node as [[Mojo::DOM]] objects.

source: Return a L<Mojo::Collection> object containing all sibling nodes before this node as L<Mojo::DOM> objects.
ja: Return a [[Mojo::Collection]] object containing all sibling nodes before this node as [[Mojo::DOM]] objects.

source: Return a L<Mojo::File> object relative to the current working directory.
ja: Return a [[Mojo::File]] object relative to the current working directory.

source: Return a new L<Mojo::ByteStream> object cloned from this bytestream.
ja: Return a new [[Mojo::ByteStream]] object cloned from this bytestream.

source: Return a new L<Mojo::Content::MultiPart> object cloned from this content if possible, otherwise return C<undef>.
ja: Return a new [[Mojo::Content::MultiPart]] object cloned from this content if possible, otherwise return C<undef>.

source: Return a new L<Mojo::Content::Single> object cloned from this content if possible, otherwise return C<undef>.
ja: Return a new [[Mojo::Content::Single]] object cloned from this content if possible, otherwise return C<undef>.

source: Return a new L<Mojo::Content> object cloned from this content if possible, otherwise return C<undef>.
ja: Return a new [[Mojo::Content]] object cloned from this content if possible, otherwise return C<undef>.

source: Return a new L<Mojo::File> object relative to the directory part of the path.
ja: Return a new [[Mojo::File]] object relative to the directory part of the path.

source: Return a new L<Mojo::File> object relative to the path.
ja: Return a new [[Mojo::File]] object relative to the path.

source: Return a new L<Mojo::Headers> object cloned from these headers.
ja: Return a new [[Mojo::Headers]] object cloned from these headers.

source: Return a new L<Mojo::Home> object relative to the home directory.
ja: Return a new [[Mojo::Home]] object relative to the home directory.

source: Return a new L<Mojo::Message::Request> object cloned from this request if possible, otherwise return C<undef>.
ja: Return a new [[Mojo::Message::Request]] object cloned from this request if possible, otherwise return C<undef>.

source: Return a new L<Mojo::Parameters> object cloned from these parameters.
ja: Return a new [[Mojo::Parameters]] object cloned from these parameters.

source: Return a new L<Mojo::Path> object cloned from this path.
ja: Return a new [[Mojo::Path]] object cloned from this path.

source: Return a new L<Mojo::Promise> object cloned from this promise that is still pending.
ja: Return a new [[Mojo::Promise]] object cloned from this promise that is still pending.

source: Return a new L<Mojo::URL> object cloned from this URL.
ja: Return a new [[Mojo::URL]] object cloned from this URL.

source: Return a new L<Mojo::URL> object cloned from this relative URL and turn it into an absolute one using L</"base"> or provided base URL.
ja: Return a new [[Mojo::URL]] object cloned from this relative URL and turn it into an absolute one using [[/"base"]] or provided base URL.

source: Return a proxy object containing the current controller object and on which helpers provided by L</"app"> can be called.
ja: Return a proxy object containing the current controller object and on which helpers provided by [[/"app"]] can be called.

source: Return a relative path from the original path to the destination path as a L<Mojo::File> object.
ja: Return a relative path from the original path to the destination path as a [[Mojo::File]] object.

source: Return absolute path as a L<Mojo::File> object, the path does not need to exist on the file system.
ja: Return absolute path as a [[Mojo::File]] object, the path does not need to exist on the file system.

source: Return all L<Mojo::Cookie::Response> objects that are currently stored in the jar.
ja: Return all [[Mojo::Cookie::Response]] objects that are currently stored in the jar.

source: Return all but the last level of the path with L<File::Basename> as a L<Mojo::File> object.
ja: Return all but the last level of the path with [[File::Basename]] as a [[Mojo::File]] object.

source: Return default template name for L<Mojolicious::Controller> object, or C<undef> if no name could be generated.
ja: Return default template name for [[Mojolicious::Controller]] object, or C<undef> if no name could be generated.

source: Return fractional amount of time in seconds since named timstamp has been created with L</"timing-E<gt>begin"> or C<undef> if no such timestamp exists.
ja: Return fractional amount of time in seconds since named timstamp has been created with [[/"timing-E<gt>begin"]] or C<undef> if no such timestamp exists.

source: Return the full template path for an options hash reference with C<template>, C<format>, C<variant> and C<handler> values, or C<undef> if the file does not exist in L</"paths">, usually used by handlers.
ja: Return the full template path for an options hash reference with C<template>, C<format>, C<variant> and C<handler> values, or C<undef> if the file does not exist in [[/"paths"]], usually used by handlers.

source: Return the last level of the path with L<File::Basename>.
ja: Return the last level of the path with [[File::Basename]].

source: Returns a new L<Mojo::Promise> object that either fulfills when all of the passed L<Mojo::Promise> objects have fulfilled or rejects as soon as one of them rejects.
ja: Returns a new [[Mojo::Promise]] object that either fulfills when all of the passed [[Mojo::Promise]] objects have fulfilled or rejects as soon as one of them rejects.

source: Returns a new L<Mojo::Promise> object that fulfills or rejects as soon as one of the passed L<Mojo::Promise> objects fulfills or rejects, with the value or reason from that promise.
ja: Returns a new [[Mojo::Promise]] object that fulfills or rejects as soon as one of the passed [[Mojo::Promise]] objects fulfills or rejects, with the value or reason from that promise.

source: Returns the L<Mojo::Message::Response> object from L</"res"> or dies if a connection error has occurred.
ja: Returns the [[Mojo::Message::Response]] object from [[/"res"]] or dies if a connection error has occurred.

source: Returns the L<Mojolicious::Lite> application object, which is a subclass of L<Mojolicious>.
ja: Returns the [[Mojolicious::Lite]] application object, which is a subclass of [[Mojolicious]].

source: Route placeholders allow capturing parts of a request path until a C</> or C<.> separator occurs, similar to the regular expression C<([^/.]+)>.
ja: ルーティング(routes)プレースホルダを使用すると、区切り文字の / あるいは . が出現するまでの部分を、リクエストパスからキャプチャできます。

source: Router results for the current request, defaults to a L<Mojolicious::Routes::Match> object.
ja: Router results for the current request, defaults to a [[Mojolicious::Routes::Match]] object.

source: Routes are basically just fancy paths that can contain different kinds of placeholders and usually lead to an action, if they match the path part of the request URL.
ja: ルーティング(routes)とは、一般的にいうと異なる種類のプレースホルダを含むことのできる仮想的なパスのことです。通常はアクションにつながっており、リクエストURLのパス部分にマッチしたときに実行されます。

source: Routes can be restricted to specific request methods with different keywords like L<Mojolicious::Lite/"get"> and L<Mojolicious::Lite/"any">.
ja: ルーティングは [[Mojolicious::Lite/]]のC<get> や [[Mojolicious::Lite]]のC<any>といったキーワードによって特定のリクエストメソッドに限定できます。

source: Routing cache, defaults to a L<Mojo::Cache> object.
ja: Routing cache, defaults to a [[Mojo::Cache]] object.

source: Run CSS selector against L</"tree"> and stop as soon as the first node matched.
ja: Run CSS selector against [[/"tree"]] and stop as soon as the first node matched.

source: Run CSS selector against L</"tree">.
ja: Run CSS selector against [[/"tree"]].

source: Run L<PSGI>.
ja: Run [[PSGI]].

source: Run server and wait for L</"MANAGER SIGNALS">.
ja: Run server and wait for [[/"MANAGER SIGNALS"]].

source: Run server and wait for L</"SIGNALS">.
ja: Run server and wait for [[/"SIGNALS"]].

source: Run server for application and wait for L</"MANAGER SIGNALS">.
ja: Run server for application and wait for [[/"MANAGER SIGNALS"]].

source: Run server for application and wait for L</"SIGNALS">.
ja: Run server for application and wait for [[/"SIGNALS"]].

source: Same as L</"button_to">, but also includes a L</"csrf_field">.
ja: Same as [[/"button_to"]], but also includes a [[/"csrf_field"]].

source: Same as L</"completed">, but also indicates that all transaction data has been sent.
ja: Same as [[/"completed"]], but also indicates that all transaction data has been sent.

source: Same as L</"content">, but appends content to named buffers if they are already in use.
ja: Same as [[/"content"]], but appends content to named buffers if they are already in use.

source: Same as L</"content">, but replaces content of named buffers if they are already in use.
ja: Same as [[/"content"]], but replaces content of named buffers if they are already in use.

source: Same as L</"delete">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"delete"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"get">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"get"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"head">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"head"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"html_unescape">, but handles special rules from the L<HTML Living Standard|https://html.spec.whatwg.org> for HTML attributes.
ja: Same as [[/"html_unescape"]], but handles special rules from the [[HTML Living Standard|https://html.spec.whatwg.org]] for HTML attributes.

source: Same as L</"options">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"options"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"original_remote_address"> or the last value of the C<X-Forwarded-For> header if L</"req"> has been performed through a reverse proxy.
ja: Same as [[/"original_remote_address"]] or the last value of the C<X-Forwarded-For> header if [[/"req"]] has been performed through a reverse proxy.

source: Same as L</"patch">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"patch"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"post">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"post"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"put">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"put"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"render">, but renders a template file.
ja: Same as [[/"render"]], but renders a template file.

source: Same as L</"split_header">, but handles C<expires> values from L<RFC 6265|http://tools.ietf.org/html/rfc6265>.
ja: Same as [[/"split_header"]], but handles C<expires> values from [[RFC 6265|http://tools.ietf.org/html/rfc6265]].

source: Same as L</"start">, but performs all requests non-blocking and returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"start"]], but performs all requests non-blocking and returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L</"tag">, but adds the class C<field-with-error>.
ja: Same as [[/"tag"]], but adds the class C<field-with-error>.

source: Same as L</"to_string">, but includes L</"userinfo">.
ja: Same as [[/"to_string"]], but includes [[/"userinfo"]].

source: Same as L</"websocket">, but returns a L<Mojo::Promise> object instead of accepting a callback.
ja: Same as [[/"websocket"]], but returns a [[Mojo::Promise]] object instead of accepting a callback.

source: Same as L<Mojo::Transaction/"completed">, but also indicates that all transaction data has been sent.
ja: Same as [[Mojo::Transaction/"completed"]], but also indicates that all transaction data has been sent.

source: Secret passphrases used for signed cookies and the like, defaults to the L</"moniker"> of this application, which is not very secure, so you should change it!!!
ja: Secret passphrases used for signed cookies and the like, defaults to the [[/"moniker"]] of this application, which is not very secure, so you should change it!!!

source: See L</"Custom transactions"> below.
ja: See [[/"Custom transactions"]] below.

source: See L<Mojolicious::Controller/"render"> for a more user-friendly interface.
ja: See [[Mojolicious::Controller/"render"]] for a more user-friendly interface.

source: See L<Mojolicious::Guides::Routing/"Formats"> for information on customizing format detection, or consider using L<relaxed placeholders|Mojolicious::Guides::Routing/"Relaxed placeholders"> to allow matching of the C<.> character.
ja: See [[Mojolicious::Guides::Routing/"Formats"]] for information on customizing format detection, or consider using [[relaxed placeholders|Mojolicious::Guides::Routing/"Relaxed placeholders"]] to allow matching of the C<.> character.

source: See L<Mojolicious::Guides::Tutorial> and L<Mojolicious::Guides::Routing> for more information.
ja: See [[Mojolicious::Guides::Tutorial]] and [[Mojolicious::Guides::Routing]] for more information.

source: See L</"tx"> for more.
ja: See [[/"tx"]] for more.

source: See L<Mojo::UserAgent> for the complete API and return values.
ja: See [[Mojo::UserAgent]] for the complete API and return values.

source: See L<Mojolicious::Commands/"COMMANDS"> for a list of commands that are available by default.
ja: See [[Mojolicious::Commands/"COMMANDS"]] for a list of commands that are available by default.

source: See L<Mojolicious::Guides::Cookbook/"DEPLOYMENT"> for more.
ja: See [[Mojolicious::Guides::Cookbook/"DEPLOYMENT"]] for more.

source: See L<Mojolicious::Guides::Cookbook/"REAL-TIME WEB"> for more.
ja: See [[Mojolicious::Guides::Cookbook/"REAL-TIME WEB"]] for more.

source: See L<Mojolicious::Guides::Cookbook/"USER AGENT"> for more.
ja: See [[Mojolicious::Guides::Cookbook/"USER AGENT"]] for more.

source: See L<Mojolicious::Guides::Rendering> for information on how to generate content with the L<Mojolicious> renderer.
ja: See [[Mojolicious::Guides::Rendering]] for information on how to generate content with the [[Mojolicious]] renderer.

source: See L<Mojolicious::Guides::Rendering> for more.
ja: See [[Mojolicious::Guides::Rendering]] for more.

source: See L<Mojolicious::Guides::Routing> for more.
ja: See [[Mojolicious::Guides::Routing]] for more.

source: See L<Mojolicious::Guides::Testing> for more.
ja: See [[Mojolicious::Guides::Testing]] for more.

source: See L<Mojolicious::Guides::Tutorial> for more!
ja: See [[Mojolicious::Guides::Tutorial]] for more!

source: See L<Mojolicious::Guides> for more!
ja: 詳しくは [[Mojolicious::Guides]] を見てください！

source: See L<Mojolicious::Plugins/"PLUGINS"> for a list of plugins that are available by default.
ja: See [[Mojolicious::Plugins/"PLUGINS"]] for a list of plugins that are available by default.

source: See also L<Mojo::Server::Daemon/"listen"> for more examples.
ja: See also [[Mojo::Server::Daemon/"listen"]] for more examples.

source: See the L</"plugin"> method below if you want to load a plugin.
ja: See the [[/"plugin"]] method below if you want to load a plugin.

source: Select best possible representation for L<Mojolicious::Controller> object from C<format> C<GET>/C<POST> parameter, C<format> stash value, or C<Accept> request header, defaults to returning the first extension if no preference could be detected.
ja: Select best possible representation for [[Mojolicious::Controller]] object from C<format> C<GET>/C<POST> parameter, C<format> stash value, or C<Accept> request header, defaults to returning the first extension if no preference could be detected.

source: Select best possible representation for resource from C<format> C<GET>/C<POST> parameter, C<format> stash value or C<Accept> request header with L<Mojolicious::Renderer/"accepts">, defaults to returning the first extension if no preference could be detected.
ja: Select best possible representation for resource from C<format> C<GET>/C<POST> parameter, C<format> stash value or C<Accept> request header with [[Mojolicious::Renderer/"accepts"]], defaults to returning the first extension if no preference could be detected.

source: Send data serialized with L<Storable> to the parent process at any time during the subprocess's execution.
ja: Send data serialized with [[Storable]] to the parent process at any time during the subprocess's execution.

source: Serve a L<Mojo::Asset::File> or L<Mojo::Asset::Memory> object with C<Range>, C<If-Modified-Since> and C<If-None-Match> support.
ja: Serve a [[Mojo::Asset::File]] or [[Mojo::Asset::Memory]] object with C<Range>, C<If-Modified-Since> and C<If-None-Match> support.

source: Serve a specific file, relative to L</"paths"> or from L</"classes">.
ja: Serve a specific file, relative to [[/"paths"]] or from [[/"classes"]].

source: Serve static file for L<Mojolicious::Controller> object.
ja: Serve static file for [[Mojolicious::Controller]] object.

source: Sessions in L<Mojolicious> pretty much just work out of the box once you start using the method L<Mojolicious::Controller/"session">, there is no setup required, but we suggest setting a more secure passphrase with L<Mojolicious/"secrets">.
ja: Sessions in [[Mojolicious]] pretty much just work out of the box once you start using the method [[Mojolicious::Controller/"session"]], there is no setup required, but we suggest setting a more secure passphrase with [[Mojolicious/"secrets"]].

source: Set C<extends> stash value, all additional key/value pairs get merged into the L</"stash">.
ja: Set C<extends> stash value, all additional key/value pairs get merged into the [[/"stash"]].

source: Set C<layout> stash value, all additional key/value pairs get merged into the L</"stash">.
ja: Set C<layout> stash value, all additional key/value pairs get merged into the [[/"stash"]].
